src/cf/Catalogs/bon_НоминальныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>bon_НоминальныеОбъекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.bon_ВидыНоминальныхОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретНаИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Держатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБонуснойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокБуф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокОст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/AccumulationRegisters/bon_ПартииБонусовНаСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>bon_ПартииБонусовНаСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Буфер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПримВыдано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаБонуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Catalogs/bon_НоминальныеОбъекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Счета.Параметры.УстановитьЗначениеПараметра("bon_НоминальныеОбъектыСыл",  Объект.Ссылка);
	
	ОборотыПоПартиям.Параметры.УстановитьЗначениеПараметра("Ссылка",  Объект.Ссылка);
	ОборотыПоПартиям.Параметры.УстановитьЗначениеПараметра("ППериодОборК",  КонецДня(ТекущаяДата())); 
	ОборотыПоПартиям.Параметры.УстановитьЗначениеПараметра("ППериодОборН",  '00010101');
	
	ОстаткиПоПартиям.Параметры.УстановитьЗначениеПараметра("Ссылка",  Объект.Ссылка);
	ОстаткиПоПартиям.Параметры.УстановитьЗначениеПараметра("ППериод",  Дата(ТекущаяДата())); 
	
	ОбновитьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиНаСервере()
	
	ПолучИтог = Новый Запрос;
	ПолучИтог.Текст = 
	"ВЫБРАТЬ
	|	bon_ПартииБонусовНаСчетахОстаткиИОбороты.БуферПриход - bon_ПартииБонусовНаСчетахОстаткиИОбороты.БуферРасход КАК Буфер,
	|	bon_ПартииБонусовНаСчетахОстаткиИОбороты.ОстатокПриход - bon_ПартииБонусовНаСчетахОстаткиИОбороты.ОстатокРасход КАК Остаток
	|ИЗ
	|	РегистрНакопления.bon_ПартииБонусовНаСчетах.ОстаткиИОбороты(, &ТекДат, , , НоминальныйОбъект = &НоминальныйОбъект) КАК bon_ПартииБонусовНаСчетахОстаткиИОбороты";
	ПолучИтог.УстановитьПараметр("НоминальныйОбъект"	, Объект.Ссылка);
	ПолучИтог.УстановитьПараметр("ТекДат"				, Дата(ТекущаяДата()));
	УстанЗнач = ПолучИтог.Выполнить().Выгрузить();
	Если УстанЗнач.Количество()>0 Тогда
		Объект.ОстатокБуф = УстанЗнач[0].Буфер;	
		Объект.ОстатокОст =	УстанЗнач[0].Остаток;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги(Команда)
	ОбновитьИтогиНаСервере();
КонецПроцедуры
